Autodesk.Revit.DB.Electrical.WireMaterialType.RemoveGroundConductorSize(Autodesk.Revit.DB.Electrical.GroundConductorSize)
Remove an existing ground conductor size from this material type.
grdConductorSize: The ground size type to be removed.

Autodesk.Revit.DB.Electrical.WireMaterialType.AddGroundConductorSize(System.Int64,System.String)
Add new electrical ground conductor size type into this material type.
ampacity: Ampacity of ground conductor size to be added.
size: Size of ground conductor size to be added.
Returns: New added ground conductor size.

Autodesk.Revit.DB.Electrical.WireMaterialType.RemoveTemperatureRatingType(Autodesk.Revit.DB.Electrical.TemperatureRatingType)
Remove an existing temperature rating type from this material type.
temperatureRating: The temperature rating type to be removed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The last temperature rating type of project and any one used by a wire type can't be removed.

Autodesk.Revit.DB.Electrical.WireMaterialType.AddTemperatureRatingType(System.String,Autodesk.Revit.DB.Electrical.TemperatureRatingType)
Add a new temperature rating type into material type.
name: Name of temperature type to be added.
baseOn: The new temperature rating will be created base on this existing temperature rating type.
Returns: New constructed temperature rating type.

Autodesk.Revit.DB.Electrical.WireMaterialType.IsInUse
Indicate whether the wire material type is in use.

Autodesk.Revit.DB.Electrical.WireMaterialType.GroundConductorSizes
Get all ground conductor size types defined in this wire material type.

Autodesk.Revit.DB.Electrical.WireMaterialType.TemperatureRatings
Get all temperature rating type definitions defined in this wire material type.

Autodesk.Revit.DB.Electrical.WireMaterialType.Name
Get name of wire material type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Set name can't be supported.

Autodesk.Revit.DB.Electrical.WireMaterialType
Represents electrical wire material type definition information of wire type.
Remarks:
All the other properties of wire type are based on wire material type.
Only the wire material types which are retrieved from ElectricalSetting can work well, so don't retrieve it from Revit project directly.